---
kind: enumMember
id: F:Autodesk.Revit.DB.PathType.Absolute
enum: Autodesk.Revit.DB.PathType
source: html/dab91714-40d3-bc4a-6c5e-1b5eb504e341.htm
---
# Autodesk.Revit.DB.PathType.Absolute

The path is an absolute path to a location on disk or the
 network.